# HyperYOLO object detection model
nc: 80
scales:
  t: [0.33, 0.25, 1024, 6]

backbone:
  - [-1, 1, DWConv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, DWConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, DWConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, MANet, [256, True, 1, 3]] # 4
  - [-1, 1, DWConv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, MANet, [512, True, 1, 3]] # 6
  - [-1, 1, WFPB, [512, 3, 0.25]]  # 7
  - [-1, 1, DWConv, [1024, 3, 2]]  # 8-P5/32
  - [-1, 3, C2f, [1024, True]] # 9
  - [-1, 1, SPPF, [1024, 5]]  # 10

head:
 # Semantic Collecting
 - [0, 1, nn.AvgPool2d, [8, 8, 0]] # 11
 - [2, 1, nn.AvgPool2d, [4, 4, 0]] # 12
 - [4, 1, nn.AvgPool2d, [2, 2, 0]] # 13
 - [10, 1, nn.Upsample, [None, 2, 'nearest']]  # 14 upsample SPPF (20->40)
 - [6, 1, CISBA, [16]]                  # 15 P4 attention
 - [[11, 12, 13, 15, 14], 1, Concat, [1]]    # 16 cat fused 40x40

 # Hypergraph Computation
 - [-1, 1, Conv, [512, 1, 1]]              # 17
 - [-1, 1, HyperComputeModule, [512]]      # 18
 - [-1, 3, MANet, [512, True]]             # 19 (Out: 40x40)

 # Semantic Scattering
 # P5 path (Stride 32)
 - [-1, 1, nn.AvgPool2d, [2, 2, 0]]        # 20 (40->20)
 - [[-1, 10], 1, Concat, [1]]              # 21 (concat with SPPF)
 - [-1, 3, C2f, [1024, False]]             # 22 (P5 branch out)

 # P4 path (Stride 16)
 - [[19, 6], 1, Concat, [1]]               # 23 (Hyper out + P4 backbone)
 - [-1, 3, C2f, [512, False]]              # 24 (P4 branch out)

 # P3 path (Stride 8)
 - [19, 1, nn.Upsample, [None, 2, 'nearest']] # 25 (Hyper out upsampled)
 - [4, 1, CISBA, [16]]                     # 26 (P3 backbone attention)
 - [[25, 26], 1, Concat, [1]]              # 27
 - [-1, 3, C2f, [256, False]]              # 28 (P3 branch out)

 # FPN Merges
 - [-1, 1, DWConv, [256, 3, 2]]              # 29 (P3->P4)
 - [[-1, 24], 1, Concat, [1]]              # 30
 - [-1, 3, C2f, [512, False]]              # 31 (FPN P4 out)

 - [-1, 1, DWConv, [512, 3, 2]]              # 32 (P4->P5)
 - [[-1, 22], 1, Concat, [1]]              # 33
 - [-1, 3, C2f, [1024, False]]             # 34 (FPN P5 out)

 - [[28, 31, 34], 1, Detect, [nc]]        # Detect(P3, P4, P5)
